# MEPAnalytical Segment Methods

Source: https://www.revitapidocs.com/2026/9151ca5b-d3e8-3bae-e932-fd74ac38dee5.htm

---

| MEPAnalytical Segment Methods |
| --- |

The MEPAnalyticalSegment type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetFlowCharacteristics | Gets all flow characteristics of the segment. |
|  | GetFlowConvergenceCharacteristic | Gets the flow convergence characteristic of the segment. |
|  | GetFlowTransitionCharacteristic | Gets the flow transition characteristic of the segment. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetLossCoefficientOverride | Gets the overridden value of loss coefficient, dimensionless. |
|  | GetNetworkSegmentId | Gets the NetworkSegmentId. |
|  | GetPressureDropOverride | Gets the overidden value of pressuer drop, in kg/(ft\*s^2\). |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | IsSegmentOverridable | Verifies if the segment can be overridden (e.g., the pressure drop of the pump and curve segments are calculated from the network and cannot be overridden). |
|  | SetLossCoefficientOverride | Sets the overridden value of loss coefficient. |
|  | SetOverrideType | Sets the override type of pressure loss calculation. |
|  | SetPressureDropOverride | Sets the overridden value of pressure drop. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

MEPAnalyticalSegment Class Autodesk.Revit.DB.Analysis Namespace